vvgulyaev/usb_audio/Projects/STM32F746G-Discovery/Applications/USB_Device/Extension/Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_audio_ex.c
  /* Disable SAI peripheral to allow access to SAI internal registers */
  __HAL_SAI_DISABLE(&haudio_in_sai);
  
  /* Configure SAI_Block_x
  LSBFirst: Disabled
  DataSize: 16 */
  haudio_in_sai.Init.MonoStereoMode = SAI_STEREOMODE;
  haudio_in_sai.Init.AudioFrequency = AudioFreq;
  haudio_in_sai.Init.AudioMode      = SAI_MODESLAVE_RX;
  haudio_in_sai.Init.NoDivider      = SAI_MASTERDIVIDER_ENABLE;
  haudio_in_sai.Init.Protocol       = SAI_FREE_PROTOCOL;
  haudio_in_sai.Init.DataSize       = SAI_DATASIZE_16;
  haudio_in_sai.Init.FirstBit       = SAI_FIRSTBIT_MSB;
  haudio_in_sai.Init.ClockStrobing  = SAI_CLOCKSTROBING_RISINGEDGE;
  haudio_in_sai.Init.Synchro        = SAI_SYNCHRONOUS;
  haudio_in_sai.Init.OutputDrive    = SAI_OUTPUTDRIVE_DISABLE;
  haudio_in_sai.Init.FIFOThreshold  = SAI_FIFOTHRESHOLD_1QF;
  haudio_in_sai.Init.SynchroExt     = SAI_SYNCEXT_DISABLE;
  haudio_in_sai.Init.CompandingMode = SAI_NOCOMPANDING;
  haudio_in_sai.Init.TriState       = SAI_OUTPUT_RELEASED;
  haudio_in_sai.Init.Mckdiv         = 0;

  /* Configure SAI_Block_x Frame
  Frame Length: 64
  Frame active Length: 32
  FS Definition: Start frame + Channel Side identification
  FS Polarity: FS active Low
  FS Offset: FS asserted one bit before the first bit of slot 0 */
  haudio_in_sai.FrameInit.FrameLength       = 64;
  haudio_in_sai.FrameInit.ActiveFrameLength = 32;
  haudio_in_sai.FrameInit.FSDefinition      = SAI_FS_CHANNEL_IDENTIFICATION;
  haudio_in_sai.FrameInit.FSPolarity        = SAI_FS_ACTIVE_LOW;
  haudio_in_sai.FrameInit.FSOffset          = SAI_FS_BEFOREFIRSTBIT;
  
  /* Configure SAI Block_x Slot
  Slot First Bit Offset: 0
  Slot Size  : 16
  Slot Number: 4
  Slot Active: All slot active */
  haudio_in_sai.SlotInit.FirstBitOffset = 0;
  haudio_in_sai.SlotInit.SlotSize       = SAI_SLOTSIZE_DATASIZE;
  haudio_in_sai.SlotInit.SlotNumber     = 4;
  haudio_in_sai.SlotInit.SlotActive     = CODEC_AUDIOFRAME_SLOT_02;

  HAL_SAI_Init(&haudio_in_sai);

  /* Enable SAI peripheral */
  __HAL_SAI_ENABLE(&haudio_in_sai);

  /* Enable SAI peripheral to generate MCLK */
  __HAL_SAI_ENABLE(&haudio_out_sai);
}

/**
  * @brief  Deinitializes the output Audio Codec audio interface (SAI).
  * @retval None
  */
static void SAIx_In_DeInit(void)
{
  /* Initialize the haudio_in_sai Instance parameter */
  haudio_in_sai.Instance = AUDIO_IN_SAIx;
  haudio_out_sai.Instance = AUDIO_OUT_SAIx;
  /* Disable SAI peripheral */
  __HAL_SAI_DISABLE(&haudio_in_sai);

  HAL_SAI_DeInit(&haudio_in_sai);
  HAL_SAI_DeInit(&haudio_out_sai);
}

/**
  * @}
  */

/** @defgroup STM32F769I_DISCOVERY_AUDIO_In_Private_Functions STM32F769I_DISCOVERY_AUDIO_In Private Functions
  * @{
  */

/**
  * @brief  Initialize wave recording. 
  * @param  AudioFreq: Audio frequency to be configured for the DFSDM peripheral. 
  * @param  BitRes: Audio frequency to be configured for the DFSDM peripheral.
  * @param  ChnlNbr: Audio frequency to be configured for the DFSDM peripheral.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Init(uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr)
{ 
  return BSP_AUDIO_IN_InitEx(INPUT_DEVICE_ANALOG_MIC, AudioFreq, BitRes, ChnlNbr);
}

/**
  * @brief  Initialize wave recording.
  * @param  InputDevice: INPUT_DEVICE_DIGITAL_MIC or INPUT_DEVICE_ANALOG_MIC. 
  * @param  AudioFreq: Audio frequency to be configured. 
  * @param  BitRes: Audio bit resolution to be configured..
  * @param  ChnlNbr: Number of channel to be configured.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_InitEx(uint16_t InputDevice, uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr)
{ 
  uint8_t ret = AUDIO_ERROR;
  AudioIn_Device = InputDevice;
  
//  if(InputDevice == INPUT_DEVICE_DIGITAL_MIC)
//  {
//    AudioIn_ChannelNumber = ChnlNbr;
//    /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
//    BSP_AUDIO_IN_ClockConfig(&hAudioInTopLeftFilter, AudioFreq, NULL);
//
//    /* Init the SAI MSP: this __weak function can be redefined by the application*/
//    BSP_AUDIO_IN_MspInit();
//
//    /* Initializes DFSDM peripheral */
//    DFSDMx_Init(AudioFreq);
//    ret = AUDIO_OK;
//  }
//  else
  {
    /* Disable SAI */
    SAIx_In_DeInit();
    
    /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */ 
    BSP_AUDIO_OUT_ClockConfig(&haudio_in_sai, AudioFreq, NULL);
    
    haudio_in_sai.Instance = AUDIO_IN_SAIx;
    if(HAL_SAI_GetState(&haudio_in_sai) == HAL_SAI_STATE_RESET)
    {    
    BSP_AUDIO_OUT_MspInit(&haudio_in_sai, NULL);
    BSP_AUDIO_IN_MspInit();
    }

    SAIx_In_Init(AudioFreq);
    
    if((wm8994_drv.ReadID(AUDIO_I2C_ADDRESS)) == WM8994_ID)
    {
      /* Reset the Codec Registers */
      wm8994_drv.Reset(AUDIO_I2C_ADDRESS);
      /* Initialize the audio driver structure */
      audio_drv = &wm8994_drv;
      ret = AUDIO_OK;
    }
    else
    {
      ret = AUDIO_ERROR;
    }
    
    if(ret == AUDIO_OK)
    {
      /* Initialize the codec internal registers */
      audio_drv->Init(AUDIO_I2C_ADDRESS, InputDevice, 100, AudioFreq,16);
    }    
  }
  
  /* Return AUDIO_OK when all operations are correctly done */
  return ret;
}

/**
  * @brief  Allocate channel buffer scratch 
  * @param  pScratch : pointer to scratch tables.
  * @param  size of scratch buffer
  */
uint8_t BSP_AUDIO_IN_AllocScratch (int32_t *pScratch, uint32_t size)
{ 
  uint32_t idx;
  
  ScratchSize = (size / AudioIn_ChannelNumber);
  
  /* copy scratch pointers */
  for (idx = 0; idx < AudioIn_ChannelNumber; idx++)
  {
    pScratchBuff[idx] = (int32_t *)(pScratch + (idx * ScratchSize));
  }
  /* Return AUDIO_OK */
  return AUDIO_OK;
}

/**
  * @brief  Return audio in channel number 
  * @retval Number of channel
  */
uint8_t BSP_AUDIO_IN_GetChannelNumber(void)
{
  return AudioIn_ChannelNumber;
}

/**
  * @brief  Start audio recording.
  * @param  pbuf: Main buffer pointer for the recorded data storing  
  * @param  size: Current size of the recorded buffer
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Record(uint16_t* pbuf, uint32_t size)
{  
//  if (AudioIn_Device == INPUT_DEVICE_DIGITAL_MIC)
//  {
//
//    if(AudioIn_ChannelNumber > 2)
//    {
//      /* Call the Media layer start function for buttom right channel */
//      if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInButtomRightFilter, pScratchBuff[2], ScratchSize))
//      {
//        return AUDIO_ERROR;
//      }
//
//      /* Call the Media layer start function for buttom left channel */
//      if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInButtomLeftFilter, pScratchBuff[3], ScratchSize))
//      {
//        return AUDIO_ERROR;
//      }
//    }
//
//    /* Call the Media layer start function for top right channel */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInTopRightFilter, pScratchBuff[0], ScratchSize))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* Call the Media layer start function for top left channel */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInTopLeftFilter, pScratchBuff[1], ScratchSize))
//    {
//      return AUDIO_ERROR;
//    }
//  }
//  else
  {
    /* Start the process receive DMA */
    if(HAL_OK !=HAL_SAI_Receive_DMA(&haudio_in_sai, (uint8_t*)pbuf, size))
    {
      return AUDIO_ERROR;
    }
  }
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;  
}

/**
  * @brief  Stop audio recording.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Stop(void)
{
//  if (AudioIn_Device == INPUT_DEVICE_DIGITAL_MIC)
//  {
//
//    if(AudioIn_ChannelNumber > 2)
//    {
//      /* Call the Media layer stop function for buttom right channel */
//      if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInButtomRightFilter))
//      {
//        return AUDIO_ERROR;
//      }
//
//      /* Call the Media layer stop function for buttom left channel */
//      if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInButtomLeftFilter))
//      {
//        return AUDIO_ERROR;
//      }
//    }
//
//    /* Call the Media layer stop function for top right channel */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInTopRightFilter))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* Call the Media layer stop function for top left channel */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInTopLeftFilter))
//    {
//      return AUDIO_ERROR;
//    }
//  }
//  else
  {
    /* Call the Media layer stop function */
    HAL_SAI_DMAStop(&haudio_in_sai);
    
    /* Call Audio Codec Stop function */
    if(audio_drv->Stop(AUDIO_I2C_ADDRESS, CODEC_PDWN_HW) != 0)
    {
      return AUDIO_ERROR;
    }
    else
    {
      /* Wait at least 100us */
      HAL_Delay(1);
      
      /* Return AUDIO_OK when all operations are correctly done */
      return AUDIO_OK;
    }  
  }
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  Pause the audio file stream.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Pause(void)
{
//  if(AudioIn_ChannelNumber > 2)
//  {
//    /* Call the Media layer stop function */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInButtomRightFilter))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* Call the Media layer stop function */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInButtomLeftFilter))
//    {
//      return AUDIO_ERROR;
//    }
//  }
//  /* Call the Media layer stop function */
//  if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInTopRightFilter))
//  {
//    return AUDIO_ERROR;
//  }
//
//  /* Call the Media layer stop function */
//  if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&hAudioInTopLeftFilter))
//  {
//    return AUDIO_ERROR;
//  }
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  Resume the audio file stream.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Resume(void)
{ 
//  if(AudioIn_ChannelNumber > 2)
//  {
//    /* Call the Media layer start function for buttom right channel */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInButtomRightFilter, pScratchBuff[2], ScratchSize))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* Call the Media layer start function for buttom left channel */
//    if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInButtomLeftFilter, pScratchBuff[3], ScratchSize))
//    {
//      return AUDIO_ERROR;
//    }
//  }
//  /* Call the Media layer start function for top right channel */
//  if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInTopRightFilter, pScratchBuff[0], ScratchSize))
//  {
//    return AUDIO_ERROR;
//  }
//
//  /* Call the Media layer start function for top left channel */
//  if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&hAudioInTopLeftFilter, pScratchBuff[1], ScratchSize))
//  {
//    return AUDIO_ERROR;
//  }
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  Deinit the audio IN peripherals.
  * @retval None
  */
void BSP_AUDIO_IN_DeInit(void)
{
  BSP_AUDIO_IN_MspDeInit();
  
//  if(AudioIn_Device == INPUT_DEVICE_DIGITAL_MIC)
//  {
//    DFSDMx_DeInit();
//  }
//  else
  {
    SAIx_In_DeInit();
  }
}

/**
  * @brief  Regular conversion complete callback. 
  * @note   In interrupt mode, user has to read conversion value in this function
            using HAL_DFSDM_FilterGetRegularValue.
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
//void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
//{
//
//  if(hdfsdm_filter == &hAudioInTopLeftFilter)
//  {
//    DmaTopLeftRecCplt = 1;
//  }
//  else if(hdfsdm_filter == &hAudioInTopRightFilter)
//  {
//    DmaTopRightRecCplt = 1;
//  }
//  else if(hdfsdm_filter == &hAudioInButtomLeftFilter)
//  {
//    DmaButtomLeftRecCplt = 1;
//  }
//  else
//  {
//    DmaButtomRightRecCplt = 1;
//  }
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//    if((DmaTopLeftRecCplt == 1) && (DmaTopRightRecCplt == 1) && (DmaButtomLeftRecCplt == 1) && (DmaButtomRightRecCplt == 1))
//    {
//      DmaTopLeftRecCplt  = 0;
//      DmaTopRightRecCplt = 0;
//      DmaButtomLeftRecCplt  = 0;
//      DmaButtomRightRecCplt = 0;
//      BSP_AUDIO_IN_TransferComplete_CallBack();
//    }
//  }
//  else
//  {
//    if((DmaTopLeftRecCplt == 1) && (DmaTopRightRecCplt == 1))
//    {
//      DmaTopLeftRecCplt  = 0;
//      DmaTopRightRecCplt = 0;
//      BSP_AUDIO_IN_TransferComplete_CallBack();
//    }
//  }
//}

/**
  * @brief  BSP_AUDIO_IN_Get_PcmBuffer. 
  * @note   Return last received PCM buffer from scratch buffer
            
  * @param  pbuf : Buffer where to copy samples.
  * @param  sample_count : Number of samples to copy.
  * @param  ScratchOffset : Offset from where to begin copy.
  * @param  res :audio Resolution should be 2 or 3.
  * @retval None
  */
uint8_t BSP_AUDIO_IN_Get_PcmBuffer(uint8_t* pbuf, uint16_t sample_count, uint16_t ScratchOffset, uint8_t res)
{
  if( res == 2)
  {
    uint16_t*  pbuf16 =(uint16_t*)pbuf;
    
    for(int i = 0, j = ScratchOffset; j < (ScratchOffset + sample_count); j++)
    {
      pbuf16[i++] = (uint16_t)(SaturaLH((pScratchBuff[1][j] >> 8), -32760, 32760));
      pbuf16[i++] = (uint16_t)(SaturaLH((pScratchBuff[0][j] >> 8), -32760, 32760));
    }
  }
  else
  {
    uint32_t sample ;
    
    for(int i = 0, j = ScratchOffset; j < (ScratchOffset + sample_count); j++)
    {
      sample = (uint32_t)(SaturaLH((pScratchBuff[1][j] ), -8388600, 8388600));
      pbuf[i++] =(sample)&0xFF;
      pbuf[i++] =(sample>>8)&0xFF;
      pbuf[i++] =(sample>>16)&0xFF;
      sample = (uint32_t)(SaturaLH((pScratchBuff[0][j] ), -8388600, 8388600));
      pbuf[i++] =(sample)&0xFF;
      pbuf[i++] =(sample>>8)&0xFF;
      pbuf[i++] =(sample>>16)&0xFF;   
    }
  }
  return 0;
}
/**
  * @brief  Half regular conversion complete callback. 
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
//void HAL_DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
//{
//
//  if(hdfsdm_filter == &hAudioInTopLeftFilter)
//  {
//    DmaTopLeftRecHalfCplt = 1;
//  }
//  else if(hdfsdm_filter == &hAudioInTopRightFilter)
//  {
//    DmaTopRightRecHalfCplt = 1;
//  }
//  else if(hdfsdm_filter == &hAudioInButtomLeftFilter)
//  {
//    DmaButtomLeftRecHalfCplt = 1;
//  }
//  else
//  {
//    DmaButtomRightRecHalfCplt = 1;
//  }
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//    if((DmaTopLeftRecHalfCplt == 1) && (DmaTopRightRecHalfCplt == 1) && (DmaButtomLeftRecHalfCplt == 1) && (DmaButtomRightRecHalfCplt == 1))
//    {
//      DmaTopLeftRecHalfCplt  = 0;
//      DmaTopRightRecHalfCplt = 0;
//      DmaButtomLeftRecHalfCplt  = 0;
//      DmaButtomRightRecHalfCplt = 0;
//      BSP_AUDIO_IN_HalfTransfer_CallBack();
//    }
//  }
//  else
//  {
//    if((DmaTopLeftRecHalfCplt == 1) && (DmaTopRightRecHalfCplt == 1))
//    {
//      DmaTopLeftRecHalfCplt  = 0;
//      DmaTopRightRecHalfCplt = 0;
//      BSP_AUDIO_IN_HalfTransfer_CallBack();
//    }
//  }
//}

/**
  * @brief  Half reception complete callback.
  * @param  hsai : SAI handle.
  * @retval None
  */
void HAL_SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Manage the remaining file size and new address offset: This function 
     should be coded by user (its prototype is already declared in stm32769i_discovery_audio.h) */
  BSP_AUDIO_IN_HalfTransfer_CallBack();
}

/**
  * @brief  Reception complete callback.
  * @param  hsai : SAI handle.
  * @retval None
  */
void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Call the record update function to get the next buffer to fill and its size (size is ignored) */
  BSP_AUDIO_IN_TransferComplete_CallBack();
}

/**
  * @brief  User callback when record buffer is filled.
  * @retval None
  */
__weak void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
  /* This function should be implemented by the user alication.
     It is called into this driver when the current buffer is filled
     to prepare the next buffer pointer and its size. */
}

/**
  * @brief  Manages the DMA Half Transfer complete event.
  * @retval None
  */
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{ 
  /* This function should be implemented by the user application.
     It is called into this driver when the current buffer is filled
     to prepare the next buffer pointer and its size. */
}

/**
  * @brief  Audio IN Error callback function.
  * @retval None
  */
__weak void BSP_AUDIO_IN_Error_CallBack(void)
{   
  /* This function is called when an Interrupt due to transfer error on or peripheral
     error occurs. */
}

/**
  * @brief  Initialize BSP_AUDIO_IN MSP.
  * @retval None
  */
__weak void BSP_AUDIO_IN_MspInit(void)
{ 
//  if (AudioIn_Device == INPUT_DEVICE_DIGITAL_MIC)
//  {
//  /* MSP channels initialization */
//  DFSDMx_ChannelMspInit();
//  /* MSP filters initialization */
//  DFSDMx_FilterMspInit();
//  }
//  else
  {
   SAI_AUDIO_IN_MspInit(&haudio_in_sai, NULL); 
  }
}

/**
  * @brief  DeInitialize BSP_AUDIO_IN MSP.
  * @retval None
  */
__weak void BSP_AUDIO_IN_MspDeInit(void)
{
//  if (AudioIn_Device == INPUT_DEVICE_DIGITAL_MIC)
//  {
//    /* MSP channels initialization */
//    DFSDMx_ChannelMspDeInit();
//    /* MSP filters initialization */
//    DFSDMx_FilterMspDeInit();
//  }
//  else
  {
    SAI_AUDIO_IN_MspDeInit(&haudio_in_sai, NULL); 
  }
}

/**
  * @brief  Clock Config.
  * @param  hdfsdm_filter: might be required to set audio peripheral predivider if any.
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @param  Params  
  * @note   This API is called by BSP_AUDIO_IN_Init()
  *         Being __weak it can be overwritten by the application     
  * @retval None
  */

