vvgulyaev/usb_audio/Projects/STM32F746G-Discovery/Applications/USB_Device/Extension/Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_audio_ex.c
//__weak void BSP_AUDIO_IN_ClockConfig(DFSDM_Filter_HandleTypeDef *hdfsdm_filter, uint32_t AudioFreq, void *Params)
//{
//  RCC_PeriphCLKInitTypeDef rcc_ex_clk_init_struct;
//
//  HAL_RCCEx_GetPeriphCLKConfig(&rcc_ex_clk_init_struct);
//
//  /* Set the PLL configuration according to the audio frequency */
//  if((AudioFreq == AUDIO_FREQUENCY_11K) || (AudioFreq == AUDIO_FREQUENCY_22K) || (AudioFreq == AUDIO_FREQUENCY_44K))
//  {
//    /* Configure PLLSAI prescalers */
//    /* PLLSAI_VCO: VCO_429M
//    SAI_CLK(first level) = PLLSAI_VCO/PLLSAIQ = 429/2 = 214.5 Mhz
//    SAI_CLK_x = SAI_CLK(first level)/PLLSAIDIVQ = 214.5/19 = 11.289 Mhz */
//    rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
//    rcc_ex_clk_init_struct.Sai2ClockSelection = RCC_SAI1CLKSOURCE_PLLSAI;
//    rcc_ex_clk_init_struct.PLLSAI.PLLSAIN = 429;
//    rcc_ex_clk_init_struct.PLLSAI.PLLSAIQ = 2;
//    rcc_ex_clk_init_struct.PLLSAIDivQ = 19;
//
//    HAL_RCCEx_PeriphCLKConfig(&rcc_ex_clk_init_struct);
//
//  }
//  else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_48K, AUDIO_FREQUENCY_96K */
//  {
//    /* SAI clock config
//    PLLSAI_VCO: VCO_344M
//    SAI_CLK(first level) = PLLSAI_VCO/PLLSAIQ = 344/7 = 49.142 Mhz
//    SAI_CLK_x = SAI_CLK(first level)/PLLSAIDIVQ = 49.142/1 = 49.142 Mhz */
//    rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
//    rcc_ex_clk_init_struct.Sai2ClockSelection = RCC_SAI1CLKSOURCE_PLLSAI;
//    rcc_ex_clk_init_struct.PLLSAI.PLLSAIN = 344;
//    rcc_ex_clk_init_struct.PLLSAI.PLLSAIQ = 7;
//    rcc_ex_clk_init_struct.PLLSAIDivQ = 1;
//
//    HAL_RCCEx_PeriphCLKConfig(&rcc_ex_clk_init_struct);
//  }
//    rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_DFSDM1_AUDIO;
//  rcc_ex_clk_init_struct.Dfsdm1AudioClockSelection = RCC_DFSDM1AUDIOCLKSOURCE_SAI2;
//  HAL_RCCEx_PeriphCLKConfig(&rcc_ex_clk_init_struct);
//}
/*******************************************************************************
                            Static Functions
*******************************************************************************/
/**
  * @brief  Initialize the Digital Filter for Sigma-Delta Modulators interface (DFSDM).
  * @param  AudioFreq: Audio frequency to be used to set correctly the DFSDM peripheral.
  * @note   Channel output Clock Divider and Filter Oversampling are calculated as follow: 
  *         - Clock_Divider = CLK(input DFSDM)/CLK(micro) with
  *           1MHZ < CLK(micro) < 3.2MHZ (TYP 2.4MHZ for MP34DT01TR)
  *         - Oversampling = CLK(input DFSDM)/(Clock_Divider * AudioFreq)  
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
//static uint8_t DFSDMx_Init(uint32_t AudioFreq)
//{
//  /****************************************************************************/
//  /********************** Channels configuration  *****************************/
//  /****************************************************************************/
//  /* CHANNEL 1 configuration */
//  __HAL_DFSDM_CHANNEL_RESET_HANDLE_STATE(&hAudioInTopLeftChannel);
//  hAudioInTopLeftChannel.Instance                      = DFSDM1_Channel1;
//  hAudioInTopLeftChannel.Init.OutputClock.Activation   = ENABLE;
//  hAudioInTopLeftChannel.Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
//  /* Set the DFSDM clock OUT audio frequency configuration */
//  hAudioInTopLeftChannel.Init.OutputClock.Divider      = DFSDM_CLOCK_DIVIDER(AudioFreq);
//  hAudioInTopLeftChannel.Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
//  hAudioInTopLeftChannel.Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
//  hAudioInTopLeftChannel.Init.Input.Pins               = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
//  /* Request to sample stable data for LEFT micro on Rising edge */
//  hAudioInTopLeftChannel.Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_RISING;
//  hAudioInTopLeftChannel.Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
//  hAudioInTopLeftChannel.Init.Awd.FilterOrder          = DFSDM_FILTER_ORDER(AudioFreq);
//  hAudioInTopLeftChannel.Init.Awd.Oversampling         = DFSDM_OVER_SAMPLING(AudioFreq);
////  hAudioInTopLeftChannel.Init.Awd.FilterOrder          = DFSDM_CHANNEL_FASTSINC_ORDER;
////  hAudioInTopLeftChannel.Init.Awd.Oversampling         = 10;
//  hAudioInTopLeftChannel.Init.Offset                   = 0;
//  hAudioInTopLeftChannel.Init.RightBitShift            = DFSDM_RIGHT_BIT_SHIFT(AudioFreq);
//  if(HAL_OK != HAL_DFSDM_ChannelInit(&hAudioInTopLeftChannel))
//  {
//    return AUDIO_ERROR;
//  }
//
//  /* CHANNEL 0 configuration */
//  __HAL_DFSDM_CHANNEL_RESET_HANDLE_STATE(&hAudioInTopRightChannel);
//  hAudioInTopRightChannel.Instance                      = DFSDM1_Channel0;
//  hAudioInTopRightChannel.Init.OutputClock.Activation   = ENABLE;
//  hAudioInTopRightChannel.Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
//  /* Set the DFSDM clock OUT audio frequency configuration */
//  hAudioInTopRightChannel.Init.OutputClock.Divider      = DFSDM_CLOCK_DIVIDER(AudioFreq);
//  hAudioInTopRightChannel.Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
//  hAudioInTopRightChannel.Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
//  hAudioInTopRightChannel.Init.Input.Pins               = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
//  /* Request to sample stable data for RIGHT micro on Falling edge */
//  hAudioInTopRightChannel.Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_FALLING;
//  hAudioInTopRightChannel.Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
//  hAudioInTopRightChannel.Init.Awd.FilterOrder          = DFSDM_CHANNEL_FASTSINC_ORDER;
//  hAudioInTopRightChannel.Init.Awd.Oversampling         = 10;
//  hAudioInTopRightChannel.Init.Offset                   = 0;
//  hAudioInTopRightChannel.Init.RightBitShift            = DFSDM_RIGHT_BIT_SHIFT(AudioFreq);
//  if(HAL_OK != HAL_DFSDM_ChannelInit(&hAudioInTopRightChannel))
//  {
//    return AUDIO_ERROR;
//  }
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//    /* CHANNEL 5 configuration */
//    __HAL_DFSDM_CHANNEL_RESET_HANDLE_STATE(&hAudioInButtomLeftChannel);
//    hAudioInButtomLeftChannel.Instance                      = DFSDM1_Channel5;
//    hAudioInButtomLeftChannel.Init.OutputClock.Activation   = ENABLE;
//    hAudioInButtomLeftChannel.Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
//    /* Set the DFSDM clock OUT audio frequency configuration */
//    hAudioInButtomLeftChannel.Init.OutputClock.Divider      = DFSDM_CLOCK_DIVIDER(AudioFreq);
//    hAudioInButtomLeftChannel.Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
//    hAudioInButtomLeftChannel.Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
//    hAudioInButtomLeftChannel.Init.Input.Pins               = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
//    /* Request to sample stable data for LEFT micro on Rising edge */
//    hAudioInButtomLeftChannel.Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_RISING;
//    hAudioInButtomLeftChannel.Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
//    hAudioInButtomLeftChannel.Init.Awd.FilterOrder          = DFSDM_CHANNEL_FASTSINC_ORDER;
//    hAudioInButtomLeftChannel.Init.Awd.Oversampling         = 10;
//    hAudioInButtomLeftChannel.Init.Offset                   = 0;
//    hAudioInButtomLeftChannel.Init.RightBitShift            = DFSDM_RIGHT_BIT_SHIFT(AudioFreq);
//    if(HAL_OK != HAL_DFSDM_ChannelInit(&hAudioInButtomLeftChannel))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* CHANNEL 4 configuration */
//    __HAL_DFSDM_CHANNEL_RESET_HANDLE_STATE(&hAudioInButtomRightChannel);
//    hAudioInButtomRightChannel.Instance                      = DFSDM1_Channel4;
//    hAudioInButtomRightChannel.Init.OutputClock.Activation   = ENABLE;
//    hAudioInButtomRightChannel.Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
//    /* Set the DFSDM clock OUT audio frequency configuration */
//    hAudioInButtomRightChannel.Init.OutputClock.Divider      = DFSDM_CLOCK_DIVIDER(AudioFreq);
//    hAudioInButtomRightChannel.Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
//    hAudioInButtomRightChannel.Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
//    hAudioInButtomRightChannel.Init.Input.Pins               = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
//    /* Request to sample stable data for RIGHT micro on Falling edge */
//    hAudioInButtomRightChannel.Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_FALLING;
//    hAudioInButtomRightChannel.Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
//    hAudioInButtomRightChannel.Init.Awd.FilterOrder          = DFSDM_CHANNEL_FASTSINC_ORDER;
//    hAudioInButtomRightChannel.Init.Awd.Oversampling         = 10;
//    hAudioInButtomRightChannel.Init.Offset                   = 0;
//    hAudioInButtomRightChannel.Init.RightBitShift            = DFSDM_RIGHT_BIT_SHIFT(AudioFreq);
//    if(HAL_OK != HAL_DFSDM_ChannelInit(&hAudioInButtomRightChannel))
//    {
//      return AUDIO_ERROR;
//    }
//  }
//  /****************************************************************************/
//  /********************** Filters configuration  ******************************/
//  /****************************************************************************/
//
//  /* FILTER 0 configuration */
//  __HAL_DFSDM_FILTER_RESET_HANDLE_STATE(&hAudioInTopLeftFilter);
//  hAudioInTopLeftFilter.Instance                          = AUDIO_DFSDMx_TOP_LEFT_FILTER;
//  hAudioInTopLeftFilter.Init.RegularParam.Trigger         = DFSDM_FILTER_SW_TRIGGER;
//  hAudioInTopLeftFilter.Init.RegularParam.FastMode        = ENABLE;
//  hAudioInTopLeftFilter.Init.RegularParam.DmaMode         = ENABLE;
//  hAudioInTopLeftFilter.Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
//  hAudioInTopLeftFilter.Init.InjectedParam.ScanMode       = ENABLE;
//  hAudioInTopLeftFilter.Init.InjectedParam.DmaMode        = DISABLE;
//  hAudioInTopLeftFilter.Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM1_TRGO;
//  hAudioInTopLeftFilter.Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_RISING_EDGE;
//  hAudioInTopLeftFilter.Init.FilterParam.SincOrder        = DFSDM_FILTER_ORDER(AudioFreq);
//  /* Set the DFSDM Filters Oversampling to have correct sample rate */
//  hAudioInTopLeftFilter.Init.FilterParam.Oversampling     = DFSDM_OVER_SAMPLING(AudioFreq);
//  hAudioInTopLeftFilter.Init.FilterParam.IntOversampling  = 1;
//  if(HAL_OK != HAL_DFSDM_FilterInit(&hAudioInTopLeftFilter))
//  {
//    return AUDIO_ERROR;
//  }
//
//  /* Configure injected channel */
//  if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&hAudioInTopLeftFilter, AUDIO_DFSDMx_TOP_LEFT_CHANNEL, DFSDM_CONTINUOUS_CONV_ON))
//  {
//    return AUDIO_ERROR;
//  }
//
//  /* FILTER 1 configuration */
//  __HAL_DFSDM_FILTER_RESET_HANDLE_STATE(&hAudioInTopRightFilter);
//  hAudioInTopRightFilter.Instance                          = AUDIO_DFSDMx_TOP_RIGHT_FILTER;
//  hAudioInTopRightFilter.Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
//  hAudioInTopRightFilter.Init.RegularParam.FastMode        = ENABLE;
//  hAudioInTopRightFilter.Init.RegularParam.DmaMode         = ENABLE;
//  hAudioInTopRightFilter.Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
//  hAudioInTopRightFilter.Init.InjectedParam.ScanMode       = DISABLE;
//  hAudioInTopRightFilter.Init.InjectedParam.DmaMode        = DISABLE;
//  hAudioInTopRightFilter.Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM1_TRGO;
//  hAudioInTopRightFilter.Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_RISING_EDGE;
//  hAudioInTopRightFilter.Init.FilterParam.SincOrder        = DFSDM_FILTER_ORDER(AudioFreq);
//  /* Set the DFSDM Filters Oversampling to have correct sample rate */
//  hAudioInTopRightFilter.Init.FilterParam.Oversampling     = DFSDM_OVER_SAMPLING(AudioFreq);
//  hAudioInTopRightFilter.Init.FilterParam.IntOversampling  = 1;
//  if(HAL_OK != HAL_DFSDM_FilterInit(&hAudioInTopRightFilter))
//  {
//    return AUDIO_ERROR;
//  }
//  /* Configure injected channel */
//  if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&hAudioInTopRightFilter, AUDIO_DFSDMx_TOP_RIGHT_CHANNEL, DFSDM_CONTINUOUS_CONV_ON))
//  {
//    return AUDIO_ERROR;
//  }
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//    /* FILTER 2 configuration */
//    __HAL_DFSDM_FILTER_RESET_HANDLE_STATE(&hAudioInButtomLeftFilter);
//    hAudioInButtomLeftFilter.Instance                          = AUDIO_DFSDMx_BUTTOM_LEFT_FILTER;
//    hAudioInButtomLeftFilter.Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
//    hAudioInButtomLeftFilter.Init.RegularParam.FastMode        = ENABLE;
//    hAudioInButtomLeftFilter.Init.RegularParam.DmaMode         = ENABLE;
//    hAudioInButtomLeftFilter.Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
//    hAudioInButtomLeftFilter.Init.InjectedParam.ScanMode       = ENABLE;
//    hAudioInButtomLeftFilter.Init.InjectedParam.DmaMode        = DISABLE;
//    hAudioInButtomLeftFilter.Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM1_TRGO;
//    hAudioInButtomLeftFilter.Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_RISING_EDGE;
//    hAudioInButtomLeftFilter.Init.FilterParam.SincOrder        = DFSDM_FILTER_ORDER(AudioFreq);
//    /* Set the DFSDM Filters Oversampling to have correct sample rate */
//    hAudioInButtomLeftFilter.Init.FilterParam.Oversampling     = DFSDM_OVER_SAMPLING(AudioFreq);
//    hAudioInButtomLeftFilter.Init.FilterParam.IntOversampling  = 1;
//    if(HAL_OK != HAL_DFSDM_FilterInit(&hAudioInButtomLeftFilter))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* Configure injected channel */
//    if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&hAudioInButtomLeftFilter, AUDIO_DFSDMx_BUTTOM_LEFT_CHANNEL, DFSDM_CONTINUOUS_CONV_ON))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* FILTER 3 configuration */
//    __HAL_DFSDM_FILTER_RESET_HANDLE_STATE(&hAudioInButtomRightFilter);
//    hAudioInButtomRightFilter.Instance                          = AUDIO_DFSDMx_BUTTOM_RIGHT_FILTER;
//    hAudioInButtomRightFilter.Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
//    hAudioInButtomRightFilter.Init.RegularParam.FastMode        = ENABLE;
//    hAudioInButtomRightFilter.Init.RegularParam.DmaMode         = ENABLE;
//    hAudioInButtomRightFilter.Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
//    hAudioInButtomRightFilter.Init.InjectedParam.ScanMode       = DISABLE;
//    hAudioInButtomRightFilter.Init.InjectedParam.DmaMode        = DISABLE;
//    hAudioInButtomRightFilter.Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM1_TRGO;
//    hAudioInButtomRightFilter.Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_RISING_EDGE;
//    hAudioInButtomRightFilter.Init.FilterParam.SincOrder        = DFSDM_FILTER_ORDER(AudioFreq);
//    /* Set the DFSDM Filters Oversampling to have correct sample rate */
//    hAudioInButtomRightFilter.Init.FilterParam.Oversampling     = DFSDM_OVER_SAMPLING(AudioFreq);
//    hAudioInButtomRightFilter.Init.FilterParam.IntOversampling  = 1;
//    if(HAL_OK != HAL_DFSDM_FilterInit(&hAudioInButtomRightFilter))
//    {
//      return AUDIO_ERROR;
//    }
//    /* Configure injected channel */
//    if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&hAudioInButtomRightFilter, AUDIO_DFSDMx_BUTTOM_RIGHT_CHANNEL, DFSDM_CONTINUOUS_CONV_ON))
//    {
//      return AUDIO_ERROR;
//    }
//  }
//  return AUDIO_OK;
//}

/**
  * @brief  De-initialize the Digital Filter for Sigma-Delta Modulators interface (DFSDM).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
//static uint8_t DFSDMx_DeInit(void)
//{
//  /* De-initializes the DFSDM filters to allow access to DFSDM internal registers */
//  if(HAL_OK != HAL_DFSDM_FilterDeInit(&hAudioInTopLeftFilter))
//  {
//    return AUDIO_ERROR;
//  }
//
//  if(HAL_OK != HAL_DFSDM_FilterDeInit(&hAudioInTopRightFilter))
//  {
//    return AUDIO_ERROR;
//  }
//
//  /* De-initializes the DFSDM channels to allow access to DFSDM internal registers */
//  if(HAL_OK != HAL_DFSDM_ChannelDeInit(&hAudioInTopLeftChannel))
//  {
//    return AUDIO_ERROR;
//  }
//
//  if(HAL_OK != HAL_DFSDM_ChannelDeInit(&hAudioInTopRightChannel))
//  {
//    return AUDIO_ERROR;
//  }
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//    /* De-initializes the DFSDM filters to allow access to DFSDM internal registers */
//    if(HAL_OK != HAL_DFSDM_FilterDeInit(&hAudioInButtomLeftFilter))
//    {
//      return AUDIO_ERROR;
//    }
//
//    if(HAL_OK != HAL_DFSDM_FilterDeInit(&hAudioInButtomRightFilter))
//    {
//      return AUDIO_ERROR;
//    }
//
//    /* De-initializes the DFSDM channels to allow access to DFSDM internal registers */
//    if(HAL_OK != HAL_DFSDM_ChannelDeInit(&hAudioInButtomLeftChannel))
//    {
//      return AUDIO_ERROR;
//    }
//
//    if(HAL_OK != HAL_DFSDM_ChannelDeInit(&hAudioInButtomRightChannel))
//    {
//      return AUDIO_ERROR;
//    }
//  }
//
//  return AUDIO_OK;
//}

