vvgulyaev/usb_audio/Projects/STM32F746G-Discovery/Applications/USB_Device/Extension/Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_audio_ex.c
/**
  * @brief  Initialize the DFSDM channel MSP.
  * @retval None
  */
//static void DFSDMx_ChannelMspInit(void)
//{
//  GPIO_InitTypeDef  GPIO_InitStruct;
//
//  /* Enable DFSDM clock */
//  AUDIO_DFSDMx_CLK_ENABLE();
//
//  /* Enable GPIO clock */
//  AUDIO_DFSDMx_DMIC_DATIN_GPIO_CLK_ENABLE();
//  AUDIO_DFSDMx_CKOUT_DMIC_GPIO_CLK_ENABLE();
//
//  /* DFSDM pins configuration: DFSDM_CKOUT, DMIC_DATIN1 pins ------------------*/
//  GPIO_InitStruct.Pin = AUDIO_DFSDMx_CKOUT_PIN;
//  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
//  GPIO_InitStruct.Alternate = AUDIO_DFSDMx_CKOUT_AF;
//  HAL_GPIO_Init(AUDIO_DFSDMx_CKOUT_DMIC_GPIO_PORT, &GPIO_InitStruct);
//
//  /* DFSDM pin configuration: DMIC_DATIN1 pin --------------------------------*/
//  GPIO_InitStruct.Pin = AUDIO_DFSDMx_DMIC_DATIN1_PIN;
//  GPIO_InitStruct.Alternate = AUDIO_DFSDMx_DMIC_DATIN_AF;
//  HAL_GPIO_Init(AUDIO_DFSDMx_DMIC_DATIN_GPIO_PORT, &GPIO_InitStruct);
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//  /* DFSDM pin configuration: DMIC_DATIN5 pin --------------------------------*/
//    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DMIC_DATIN5_PIN;
//    GPIO_InitStruct.Alternate = AUDIO_DFSDMx_DMIC_DATIN_AF;
//    HAL_GPIO_Init(AUDIO_DFSDMx_DMIC_DATIN_GPIO_PORT, &GPIO_InitStruct);
//  }
//}
//
///**
//  * @brief  DeInitialize the DFSDM channel MSP.
//  * @retval None
//  */
//static void DFSDMx_ChannelMspDeInit(void)
//{
//  GPIO_InitTypeDef  GPIO_InitStruct;
//
//  /* DFSDM pin configuration: DMIC_DATIN1 pin --------------------------------*/
//  GPIO_InitStruct.Pin = AUDIO_DFSDMx_CKOUT_PIN;
//  HAL_GPIO_DeInit(AUDIO_DFSDMx_CKOUT_DMIC_GPIO_PORT, GPIO_InitStruct.Pin);
//  GPIO_InitStruct.Pin = AUDIO_DFSDMx_DMIC_DATIN1_PIN;
//  HAL_GPIO_DeInit(AUDIO_DFSDMx_DMIC_DATIN_GPIO_PORT, GPIO_InitStruct.Pin);
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//    /* DFSDM pin configuration: DMIC_DATIN5 pin ------------------------------*/
//    GPIO_InitStruct.Pin = AUDIO_DFSDMx_CKOUT_PIN;
//    HAL_GPIO_DeInit(AUDIO_DFSDMx_CKOUT_DMIC_GPIO_PORT, GPIO_InitStruct.Pin);
//    GPIO_InitStruct.Pin = AUDIO_DFSDMx_DMIC_DATIN5_PIN;
//    HAL_GPIO_DeInit(AUDIO_DFSDMx_DMIC_DATIN_GPIO_PORT, GPIO_InitStruct.Pin);
//  }
//}
//
///**
//  * @brief  Initialize the DFSDM filter MSP.
//  * @retval None
//  */
//static void DFSDMx_FilterMspInit(void)
//{
//  /* Enable DFSDM clock */
//  AUDIO_DFSDMx_CLK_ENABLE();
//
//  /* Enable the DMA clock */
//  AUDIO_DFSDMx_DMAx_CLK_ENABLE();
//
//  /*********** Configure DMA stream for TOP LEFT microphone *******************/
//  hDmaTopLeft.Init.Direction           = DMA_PERIPH_TO_MEMORY;
//  hDmaTopLeft.Init.PeriphInc           = DMA_PINC_DISABLE;
//  hDmaTopLeft.Init.MemInc              = DMA_MINC_ENABLE;
//  hDmaTopLeft.Init.PeriphDataAlignment = AUDIO_DFSDMx_DMAx_PERIPH_DATA_SIZE;
//  hDmaTopLeft.Init.MemDataAlignment    = AUDIO_DFSDMx_DMAx_MEM_DATA_SIZE;
//  hDmaTopLeft.Init.Mode                = DMA_CIRCULAR;
//  hDmaTopLeft.Init.Priority            = DMA_PRIORITY_HIGH;
//  hDmaTopLeft.Instance                 = AUDIO_DFSDMx_DMAx_TOP_LEFT_STREAM;
//  hDmaTopLeft.Init.Channel             = AUDIO_DFSDMx_DMAx_CHANNEL;
//
//  /* Associate the DMA handle */
//  __HAL_LINKDMA(&hAudioInTopLeftFilter, hdmaReg, hDmaTopLeft);
//
//  /* Reset DMA handle state */
//  __HAL_DMA_RESET_HANDLE_STATE(&hDmaTopLeft);
//
//  /* Configure the DMA Channel */
//  HAL_DMA_Init(&hDmaTopLeft);
//
//  /* DMA IRQ Channel configuration */
//  HAL_NVIC_SetPriority(AUDIO_DFSDMx_DMAx_TOP_LEFT_IRQ, AUDIO_IN_IRQ_PREPRIO, 0);
//  HAL_NVIC_EnableIRQ(AUDIO_DFSDMx_DMAx_TOP_LEFT_IRQ);
//
//
//  /*********** Configure DMA stream for TOP RIGHT microphone ******************/
//  hDmaTopRight.Init.Direction           = DMA_PERIPH_TO_MEMORY;
//  hDmaTopRight.Init.PeriphInc           = DMA_PINC_DISABLE;
//  hDmaTopRight.Init.MemInc              = DMA_MINC_ENABLE;
//  hDmaTopRight.Init.PeriphDataAlignment = AUDIO_DFSDMx_DMAx_PERIPH_DATA_SIZE;
//  hDmaTopRight.Init.MemDataAlignment    = AUDIO_DFSDMx_DMAx_MEM_DATA_SIZE;
//  hDmaTopRight.Init.Mode                = DMA_CIRCULAR;
//  hDmaTopRight.Init.Priority            = DMA_PRIORITY_HIGH;
//  hDmaTopRight.Instance                 = AUDIO_DFSDMx_DMAx_TOP_RIGHT_STREAM;
//  hDmaTopRight.Init.Channel             = AUDIO_DFSDMx_DMAx_CHANNEL;
//
//  /* Associate the DMA handle */
//  __HAL_LINKDMA(&hAudioInTopRightFilter, hdmaReg, hDmaTopRight);
//
//  /* Reset DMA handle state */
//  __HAL_DMA_RESET_HANDLE_STATE(&hDmaTopRight);
//
//  /* Configure the DMA Channel */
//  HAL_DMA_Init(&hDmaTopRight);
//
//  /* DMA IRQ Channel configuration */
//  HAL_NVIC_SetPriority(AUDIO_DFSDMx_DMAx_TOP_RIGHT_IRQ, AUDIO_IN_IRQ_PREPRIO, 0);
//  HAL_NVIC_EnableIRQ(AUDIO_DFSDMx_DMAx_TOP_RIGHT_IRQ);
//
//  if(AudioIn_ChannelNumber > 2)
//  {
//    /*********** Configure DMA stream for BUTTOM LEFT microphone ****************/
//    hDmaButtomLeft.Init.Direction           = DMA_PERIPH_TO_MEMORY;
//    hDmaButtomLeft.Init.PeriphInc           = DMA_PINC_DISABLE;
//    hDmaButtomLeft.Init.MemInc              = DMA_MINC_ENABLE;
//    hDmaButtomLeft.Init.PeriphDataAlignment = AUDIO_DFSDMx_DMAx_PERIPH_DATA_SIZE;
//    hDmaButtomLeft.Init.MemDataAlignment    = AUDIO_DFSDMx_DMAx_MEM_DATA_SIZE;
//    hDmaButtomLeft.Init.Mode                = DMA_CIRCULAR;
//    hDmaButtomLeft.Init.Priority            = DMA_PRIORITY_HIGH;
//    hDmaButtomLeft.Instance                 = AUDIO_DFSDMx_DMAx_BUTTOM_LEFT_STREAM;
//    hDmaButtomLeft.Init.Channel             = AUDIO_DFSDMx_DMAx_CHANNEL;
//
//    /* Associate the DMA handle */
//    __HAL_LINKDMA(&hAudioInButtomLeftFilter, hdmaReg, hDmaButtomLeft);
//
//    /* Reset DMA handle state */
//    __HAL_DMA_RESET_HANDLE_STATE(&hDmaButtomLeft);
//
//    /* Configure the DMA Channel */
//    HAL_DMA_Init(&hDmaButtomLeft);
//
//    /* DMA IRQ Channel configuration */
//    HAL_NVIC_SetPriority(AUDIO_DFSDMx_DMAx_BUTTOM_LEFT_IRQ, AUDIO_IN_IRQ_PREPRIO, 0);
//    HAL_NVIC_EnableIRQ(AUDIO_DFSDMx_DMAx_BUTTOM_LEFT_IRQ);
//
//
//    /*********** Configure DMA stream for BUTTOM RIGHT microphone ***************/
//    hDmaButtomRight.Init.Direction           = DMA_PERIPH_TO_MEMORY;
//    hDmaButtomRight.Init.PeriphInc           = DMA_PINC_DISABLE;
//    hDmaButtomRight.Init.MemInc              = DMA_MINC_ENABLE;
//    hDmaButtomRight.Init.PeriphDataAlignment = AUDIO_DFSDMx_DMAx_PERIPH_DATA_SIZE;
//    hDmaButtomRight.Init.MemDataAlignment    = AUDIO_DFSDMx_DMAx_MEM_DATA_SIZE;
//    hDmaButtomRight.Init.Mode                = DMA_CIRCULAR;
//    hDmaButtomRight.Init.Priority            = DMA_PRIORITY_HIGH;
//    hDmaButtomRight.Instance                 = AUDIO_DFSDMx_DMAx_BUTTOM_RIGHT_STREAM;
//    hDmaButtomRight.Init.Channel             = AUDIO_DFSDMx_DMAx_CHANNEL;
//
//    /* Associate the DMA handle */
//    __HAL_LINKDMA(&hAudioInButtomRightFilter, hdmaReg, hDmaButtomRight);
//
//    /* Reset DMA handle state */
//    __HAL_DMA_RESET_HANDLE_STATE(&hDmaButtomRight);
//
//    /* Configure the DMA Channel */
//    HAL_DMA_Init(&hDmaButtomRight);
//
//    /* DMA IRQ Channel configuration */
//    HAL_NVIC_SetPriority(AUDIO_DFSDMx_DMAx_BUTTOM_RIGHT_IRQ, AUDIO_IN_IRQ_PREPRIO, 0);
//    HAL_NVIC_EnableIRQ(AUDIO_DFSDMx_DMAx_BUTTOM_RIGHT_IRQ);
//  }
//}

/**
  * @brief  DeInitialize the DFSDM filter MSP.
  * @retval None
  */
//static void DFSDMx_FilterMspDeInit(void)
//{
//  /* Configure the DMA Channel */
//  HAL_DMA_DeInit(&hDmaTopLeft);
//  HAL_DMA_DeInit(&hDmaTopRight);
//  if(AudioIn_ChannelNumber > 2)
//  {
//    HAL_DMA_DeInit(&hDmaButtomLeft);
//    HAL_DMA_DeInit(&hDmaButtomRight);
//  }
//}

/**
  * @}
  */ 
  
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
